class LoanClass {
  String lName;
  String sDes;
  String forWho;
  String iRate;
  String maxLimit;
  String maxRepay;
  String eligibles;

  LoanClass(
      {this.lName,
      this.sDes,
      this.forWho,
      this.iRate,
      this.maxLimit,
      this.maxRepay,
      this.eligibles});
}

List<LoanClass> loan1 = [

  LoanClass(
      lName: 'සෞභාග්‍යා',
      sDes: 'කුඩා හෝ මධ්‍ය පරිමාණ ව්‍යාපෘති, ව්‍යාපාර, නිෂ්පාදන කර්මාන්ත සඳහා',
      forWho: 'නව ව්‍යාපාර හෝ ව්‍යාපෘති ඇරඹීමට අදහස් කරන්නන්,ව්‍යවසායකයින්',
      iRate: '6%',
      maxLimit: 'රු. මිලියන 25',
      maxRepay: 'අවුරුදු 5',
      eligibles:
          'අපනයන මල්, කෙසෙල්, හතු, කුරුඳු, පැෂන් පේර, කරවල නිෂ්පාදන, සත්ව පාලනය, ඇඟලුම් කර්මාන්තය, මදුරුදැල්, ලෙදර් බෑග්, ලෙදර් සපත්තු, අත්කම්, ගඩොල්, බ්ලොක්ගල්, සිමෙන්ති ආශ්‍රිත නිෂ්පාදන, වඩු කර්මාන්ත, රූපලාවන්‍ය කටයුතු, හඳුන්කූරු, කුළුබඩු, බේකරි කෑම හා රසකැවිලි, පපඩම්, කජු, යෝගට්, මීකිරි නිෂ්පාදන, වෙල්ඩින් වැඩ, කම්මල් වැඩ, බල්බ්, ඇළුමිනියම්, සුදු යකඩ කර්මාන්ත, විසිතුරු මත්ස්‍ය වගාව, කොහු කර්මාන්තය, කොසු, ඉදල් නිපැයුම, රත්තරන්, පිත්තල, වලං කර්මාන්ත, ශරීර සුවතා, දුරකථන සන්නිවේදන, මුද්‍රණ, අධ්‍යාපන ආයතන'),

  LoanClass(
      lName: 'SRDBP',
      sDes: 'කුඩා හෝ මධ්‍ය පරිමාණ ව්‍යාපෘති, ව්‍යාපාර, නිෂ්පාදන කර්මාන්ත සඳහා',
      forWho: 'සුළු හා මධ්‍ය පරිමාණ ව්‍යවසායකයින්',
      iRate: '18%',
      maxLimit:
          'පුද්ගලයින් සඳහා - රු. මිලියන 50 , සමාගම් සඳහා - රු. මිලියන 100',
      maxRepay: 'අවුරුදු 10',
      eligibles: 'සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර'),

  LoanClass(
      lName: 'SMELoC',
      sDes: 'ක්ෂුද්‍ර, සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර සඳහා',
      forWho:
          'නව ව්‍යාපාර හෝ ව්‍යාපෘති ඇරඹීමට අදහස් කරන්නන්, කාන්තා ව්‍යවසායකයින්ට විශේෂයි',
      iRate: '8.8%',
      maxLimit: 'රු. මිලියන 50',
      maxRepay: 'අවුරුදු 10',
      eligibles: 'ක්ෂුද්‍ර, සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර'),

  LoanClass(
      lName: 'SMILE III',
      sDes: 'ක්ෂුද්‍ර, සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර සඳහා',
      forWho: 'සුළු හා මධ්‍ය පරිමාණ ව්‍යවසායකයින්',
      iRate: '8%',
      maxLimit: 'රු. මිලියන 25',
      maxRepay: 'අවුරුදු 10',
      eligibles:
          'ක්ෂුද්‍ර, සුළු හා මධ්‍ය පරිමාණ ව්‍යාපාර, සත්ව පාලන හා පශු සම්පත්, කෘෂිකර්මාන්ත හා කර්මාන්ත ව්‍යාපෘති'),
];

List<LoanClass> loan2 = [
  LoanClass(
      lName: 'SAPP 4P',
      sDes: 'කුඩා කෘෂි ව්‍යාපෘති සඳහා',
      forWho: 'කුඩා පරිමාණ කෘෂිකර්මයේ යෙදෙන ඔබට',
      iRate: '6.5%',
      maxLimit: 'වයස් සීමා අනුව රු. 300,000 සිට මිලියන 2 දක්වා',
      maxRepay: 'වාරික ගෙවන ආකාරය හා වයස් සීමා අනුව මාස 18 හෝ අවුරුදු 3 හෝ අවුරුදු 5',
      eligibles: 'කුඩා පරිමාණ කෘෂි ව්‍යවසාය හෝ ව්‍යාපෘති'),

  LoanClass(
      lName: 'SAPP RF',
      sDes: 'කුඩා පරිමාණ කෘෂි කාර්මික කටයුතු සඳහා',
      forWho: 'කුඩා පරිමාණ කෘෂි ව්‍යවසායකයින් සඳහා',
      iRate: '6.5%',
      maxLimit: 'රු. 300,000 සිට රු. මිලියන 2 දක්වා',
      maxRepay: 'වාරික ගෙවන ආකාරය හා වයස් සීමා අනුව මාස 18 හෝ අවුරුදු 3 හෝ අවුරුදු 5',
      eligibles: 'කුඩා පරිමාණ කෘෂි ව්‍යවසාය'),

  LoanClass(
      lName: 'නව සපිරි ග්‍රාමීය ණය (NCRCS)',
      sDes: 'වී වගාව හෝ කන්න භෝග වගාව සඳහා',
      forWho: 'වී වගාවෙ හෝ කන්න භෝග වගාවේ නිරතවන්නන්ට',
      iRate: '9%',
      maxLimit: 'ඉඩම් ප්‍රමාණය, වගාව හා කන්නය අනුව තීරණය කෙරේ',
      maxRepay: 'මාස 9',
      eligibles: 'වී වගාව හෝ කන්න භෝග වගාව '),

  LoanClass(
      lName: 'SMELoC - tea',
      sDes: 'තේ වගාව හා ඒ සම්බන්ධ වෙනත් කටයුතුවල යෙදවීමට',
      forWho: 'කුඩා තේ වතු හිමියන්',
      iRate: '4.84%',
      maxLimit: 'රු. මිලියන 30',
      maxRepay: 'අවුරුදු 10',
      eligibles: 'තේ වගා කිරීම, වගා පුනරුත්ථාපනය, නඩත්තුව, ජල සම්පාදනය, තවාන් දැමීම වැනි කටයුතු උදෙසා')
];

List<LoanClass> loan3 = [

  LoanClass(
      lName: 'කප්රුක ආයෝජන',
      sDes: 'පොල් වගාව හා ඒ සම්බන්ධ වෙනත් කටයුතුවල යෙදවීමට',
      forWho: 'පොල්වගාවෙහි හා ඒ ආශ්‍රිත ව්‍යාපෘති වල නියැලෙන්නන්ට',
      iRate: '8%',
      maxLimit: 'රු. මිලියන 3',
      maxRepay: 'අවුරුදු 5',
      eligibles: 'පොල් වගා කිරීම, වගා පුනරුත්ථාපනය, වගාව නඩත්තු කිරීම, වගාවට ජල සම්පාදනය, පොල් වගාව තුළ වෙනත් අතුරු භෝග වගාව, පොල් ඉඩමේ එළ ගව, මී ගව, එළු, බැටළු පාලනය, වගාවට අවශ්‍ය යන්ත්‍රෝපකරණ මිළට ගැනීම'),

  LoanClass(
      lName: 'කප්රුක ජය ඉසුර',
      sDes: 'පොල් ආශ්‍රිත නිෂ්පාදන වැඩිදියුණුව සඳහා',
      forWho: 'පොල් ආශ්‍රිත කර්මාන්ත හා නිෂ්පාදන වල නියුතු ඔබට',
      iRate: 'ණය අවශ්‍යතාවය අනුව 6% හෝ 8%',
      maxLimit: 'රු මිලියන 3.5',
      maxRepay: 'ණය ලබාගත් අවශ්‍යතාවය මත අවුරුදු 3 හෝ අවුරුදු 7',
      eligibles: 'පෙට්ටි කුට්ටම් ක්‍රමයට කොහු නිෂ්පාදනය, පොල්කටු අඟුරු, පොල්තෙල් නිෂ්පාදනය'),

  LoanClass(
      lName: 'කප්තුරු ඉසුර',
      sDes: 'පොල් වගා ආශ්‍රිත කර්මාන්ත කරුවන්ගේ සංවර්ධනය සඳහා',
      forWho: 'ප්‍රාථමික කප්රුක සමිති සාමාජික ඔබට',
      iRate: '7%',
      maxLimit: 'රු. 200,000',
      maxRepay: 'ණය ලබාගත් අවශ්‍යතාවය මත තීරණය කෙරේ',
      eligibles:
          'ප්‍රාථමික කප්රුක සමිති සාමාජිකයන්ට ජීවනෝපාය හෝ තම කර්මාන්තය සංවර්ධනය කර ගැනීමට'),

  LoanClass(
      lName: 'කප්රුක බෝග ආරක්ෂණ',
      sDes: 'වගාව ආරක්ෂා කිරීම සඳහා',
      forWho: 'පොල් වගාව ආරක්ෂණය කිරීමට අවශ්‍ය ඔබට',
      iRate: '8%',
      maxLimit: 'රු මිලියන 2',
      maxRepay: 'අවුරුදු 5',
      eligibles: 'වගාව ආරක්ෂාව සඳහා විදුලි වැට හා ආරක්ෂිත වැටවල් ඉදි කිරීම, නඩත්තු කිරීම, අලුත්වැඩියාව, තාක්ෂණික පද්ධති සකස් කිරීම, හා පොල් පැළ ආරක්ෂණ ආවරණ හා වෙනත් ක්‍රමවේද'),

  LoanClass(
      lName: 'කප්රුක ගොවිපළ යන්ත්‍රෝපකරණ ණය',
      sDes: 'පොල් වගාව ආශ්‍රිත ගොවිපල යන්ත්‍රෝපකරණ ලබාගැනීමට',
      forWho: 'පොල්වගාවෙහි හා ඒ ආශ්‍රිත ව්‍යාපෘති වල නියැලෙන්නන්ට',
      iRate: '8%',
      maxLimit: 'රු මිලියන 2',
      maxRepay: 'අවුරුදු 5',
      eligibles: 'පොල් වගාව පදනම් කරගත් ගොවිපල පද්ධති සඳහා අවශ්‍ය සියලුම කෘෂි යන්ත්‍රෝපකරණ ලබා ගැනීම සඳහා'),
];

List<LoanClass> loan4 = [

  LoanClass(
      lName: 'SMELoC III - Emergency Response',
      sDes: 'Covid-19 බලපෑමට ලක්වූ ක්ෂුද්‍ර, සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර සඳහා',
      forWho: 'Covid-19 නිසා එදිනෙදා කටයුතු වලට මූල්‍යයමය අවශ්‍යතා ඇතිවූ ව්‍යාපාර හිමියන්',
      iRate: '4.78%',
      maxLimit: 'රු. මිලියන 10',
      maxRepay: 'අවුරුදු 3',
      eligibles: 'ක්ෂුද්‍ර, සුළු හෝ මධ්‍ය ප්‍රමාණයේ ව්‍යවසාය හෝ ව්‍යාපාර'),

  LoanClass(
      lName: 'ප්‍රබෝධනී (PAMP RF) ණය ක්‍රමය',
      sDes: 'අඩු ආදායම්ලාභීන්ට කුඩා කණ්ඩායම් ණය',
      forWho: 'ණය ලබා ගැනීමට අපහසු අඩුආදායම්ලාභී ඔබට',
      iRate: '12%',
      maxLimit: 'රු. 50,000',
      maxRepay: 'අවුරුදු 3',
      eligibles: 'ගාල්ල, හම්බන්තොට, මාතර, මහනුවර, මාතලේ, නුවරඑළිය, කුරුණෑගල, කෑගල්ල, කොළඹ, ගම්පහ, කළුතර, පුත්තලම දිස්ත්‍රික්ක වල පමණක් ක්‍රියාත්මක වන කුඩා කණ්ඩායම් සාමාජිකයන් හට ඉල්ලුම් කළ හැක.'),
];
